<template>
    <section class="About_BETAPROCTECT montserrat-nav">
        <div class="About_BETAPROTECT_container">
            <div class="content-wrapper">
                <div class="text-container">
                    <div class="About_BETAPROTECT_container_text">
                        <h1>О нас</h1>
                        <p>
                            На протяжении многих лет, с 2002 года, ИНСТИТУТ БИОПРЕПАРАТОВ ООО "МЕД КОМПЛЕКС" занимается разработкой качественных средств для улучшения здоровья и самочувствия своих клиентов.  Нам доверяют люди из разных стран мира, и мы получаем большое количество положительных отзывов об эффективности нашей продукции.
                            <br><br>ИНСТИТУТ БИОПРЕПАРАТОВ ООО "МЕД КОМПЛЕКС" работает с ведущими диетологами, и поэтому мы сможем подобрать для вас индивидуальную программу похудения.  Все препараты и методики, предлагаемые  нашими специалистами, основаны на новейших исследованиях в области косметологии и диетологии. Мы поможем вам нормализовать состояние обмена веществ, определить процентное соотношение жира и воды в вашем организме, а также предложить идеальную для вас динамику  снижения веса и борьбы за здоровье ваших суставов и мужскую силу.
                        </p>
                    </div>
                </div>
                <div class="benefits-container">
                    <Benefits/>
                </div>
            </div>
            <div class="full-width-text ">
                <p>
                    Еще один эффективный препарат — это  «Кофе Минсер Форте». Употребляя его, вы сможете не только скинуть несколько лишних килограммов, но и получить удовольствие. Это действительно один из лучших натуральных продуктов для вашего здоровья и хорошего самочувствия. Благодаря «Кофе Минсер Форте» теперь можно просто пить кофе и терять до 15 кг за 40 дней. Хороший результат, не правда ли? Наш кофе для похудения — это продукт, тщательно разработанный по специальной формуле, не содержащий химических консервантов и искусственных ароматизаторов, он абсолютно безопасен для здоровья. Мы уверенно можем сказать, что это стоящее и продуктивное средство, которое поможет достичь желаемого результата.
                    <br><br>Продукты, которыми мы занимаемся, рассчитаны не только на женщин, но и на мужчин. Качество личной жизни – важная составляющая вашего здоровья.  Препарат «Эректосил» — это средство, которое поможет увеличить половой орган мужчины и вернуть уверенность в себе. Он также достаточно эффективен и не наносит ни малейшего вреда вашему здоровью. Теперь и в таблетках – для профилактики и комплексного лечения моче-половой системы.
                    <br><br>Комплекс препаратов, которыми мы занимаемся, улучшит ваше физическое состояние, поднимет настроение и вернет жизненные силы. Мы заботимся о вашем здоровье и рады будем помочь при любом возникнувшем вопросе. Учитывая наш многолетний опыт и возможности,  Институт Биопрепаратов ООО "МЕД КОМПЛЕКС" предлагает уникальные решения в области профилактики и лечения болезней.  Мы предоставляем клиентам только самые лучшие‚ проверенные и гарантирующие результат препараты. История каждого пациента для нас очень важна и индивидуальна‚ и мы усердно стараемся поддерживать ваше доверие и не подвести ожидания каждого из вас.
                    <br><br>Реквизиты:<br><br>ООО "МЕД КОМПЛЕКС"<br><br>ОГРН: 1027700528591<br>Юридический адрес: 123557, г. Москва, Большой Тишинский пер. 43<br>Почтовый адрес: 115088, г. Москва а/я №121
                </p>
            </div>
        </div>
    </section>
</template>

<script setup>
    import Benefits from '@/components/Non-permanentComponents/Contacts.vue'
</script>

<style scoped>
.About_BETAPROCTECT {  
    color: #444;
    padding: 2rem;
    display: grid;
    justify-content: center;
}

.About_BETAPROTECT_container {
    padding: 1rem;
    text-align: justify;
    max-width: var(--max_width-primary);
    width: 100%;
}

.content-wrapper {
    display: grid;
    grid-template-columns: 75% 25%;
    gap: 1rem;
    margin-bottom: 2rem;
}

.benefits-container {
    display: flex;
    align-items: end;
}

.About_BETAPROTECT_container_text {
    line-height: 1.6;
}

.full-width-text {
    width: 100%;
    grid-column: 1 / -1;
}

@media screen and (max-width: 1024px) {
    .content-wrapper {
        grid-template-columns: 1fr;
    }
    
    .benefits-container {
        display: none;
    }
    
    .About_BETAPROTECT_container_text {
        width: 100%;
    }
}
</style>